import '../ProductData/dataDetails_model.dart';

final List<Product> bedroomProducts = [
  Product(
    name: 'غرفة نوم طوكيو',
    newPrice: 25.000,
    imageUrl: 'https://www.kabbanifurniture.com/cdn/shop/products/tokyo-master_1800x1800.jpg?v=1647010896',
    description:  '• سرير\n'
        '• دولاب\n'
        '• عدد 2 كمود\n'
        '• تسريحة مع مرايا\n\n'
        'المواصفات:\n\n'
        'الخامات:\n'
        '• مصنع من الخشب السونتا بطريقة الـMDF\n'
        '• إكسسوارات مزوده بخاصية التجميع المعدني Mini Fix\n'
        '• طبقة ميلامين عازلة للرطوبة والحرارة والسوائل ومقاومة للحشرات\n\n'
        'الأبعاد:\n'
        '• السرير: عرض 160 سم طول 200 سم\n'
        '• ظهر السرير: عرض 220 سم إرتفاع 120 سم\n'
        '• الدولاب: عرض 200 سم إرتفاع 218 سم عمق 65 سم\n'
        '• التسريحة مع المرايا: عرض 120 سم إرتفاع بالمرايا 180 سم إرتفاع بدون المرايا 80 سم عمق 40 سم\n'
        '• الكمود: عرض 50 سم إرتفاع 35 سم عمق 40 سم\n\n'
        'مقاس المرتبة المناسبة للسرير: عرض: 160 سم عمق: 195 سم\n'
        'نوع الدولاب: جرار\n\n'
        'مقاسات اخرى:\n'
        '• متاح تصميم مقاسات اخري',
  ),
  Product(
    name: 'غرفة نوم بولو',
    newPrice: 20.200,
    imageUrl: 'https://www.kabbanifurniture.com/cdn/shop/files/6_a1e0be89-9437-4a13-a05e-5b8a02c1fd6c_1800x1800.jpg?v=1714558583',
    description: '• سرير 160 سم أو سرير 180 سم\n'
        '• دولاب جرار\n'
        '• عدد 2 كمود\n'
        '• تسريحة مع مرايا\n\n'
        'مميزات:\n'
        '• متاح وحدة تخزين\n'
        '• متاح درجين في الكمود\n\n'
        'المواصفات:\n\n'
        'الخامات:\n'
        '• مصنع من الخشب السونتا بطريقة الـMDF\n'
        '• إكسسوارات مزوده بخاصية التجميع المعدني Mini Fix\n'
        '• طبقة ميلامين عازلة للرطوبة والحرارة والسوائل ومقاومة للحشرات\n\n'
        'الأبعاد:\n'
        '• السرير: عرض 160 سم طول 200 سم -  ظهر السرير: عرض 175 سم إرتفاع 134 سم\n'
        '• السرير: عرض 180 سم طول 200 سم -  ظهر السرير: عرض 195 سم إرتفاع 134 سم\n'
        '• الدولاب: عرض 240 سم إرتفاع 222 سم عمق 68 سم\n'
        '• التسريحة مع المرايا: عرض 100 سم إرتفاع بالمرايا 175 سم إرتفاع بدون المرايا 80 سم عمق 42 سم\n'
        '• الكمود: عرض 50 سم إرتفاع 44 سم عمق 44 سم\n\n'
        'مقاس المرتبة المناسبة للسرير 160 سم: عرض: 160 سم عمق: 195 سم\n'
        'مقاس المرتبة المناسبة للسرير 180 سم: عرض: 180 سم عمق: 195 سم\n\n'
        'نوع الدولاب: جرار\n'
      'متاح تصميم مقاسات اخرى\n',
  ),
  Product(
    name: 'غرفة نوم نيو ميلانو',
    newPrice: 30.390,
    imageUrl: 'https://www.kabbanifurniture.com/cdn/shop/files/85632096d3fc46da4dbf15e71b696da4_1800x1800.jpg?v=1699888668',
    description:'• سرير\n'
        '• دولاب\n'
        '• عدد 2 كمود\n'
        '• تسريحة مع مرايا\n\n'
        'المواصفات:\n\n'
        'الخامات:\n'
        '• مصنع من الخشب السونتا بطريقة الـMDF\n'
        '• إكسسوارات مزوده بخاصية التجميع المعدني Mini Fix\n'
        '• طبقة ميلامين عازلة للرطوبة والحرارة والسوائل ومقاومة للحشرات\n\n'
        'الأبعاد:\n'
        '• السرير: عرض 160 سم عمق 200 سم\n'
        '• ظهر السرير: عرض 185 سم إرتفاع 120 سم\n'
        '• الدولاب: عرض 240 سم إرتفاع 210 سم عمق 65 سم\n'
        '• التسريحة مع المرايا: عرض 100 سم إرتفاع بالمرايا 170 سم إرتفاع بدون مرايا 100 سم عمق 45 سم\n'
        '• الكمود: عرض 50 سم إرتفاع 46 سم عمق 50 سم\n\n'
        'نوع الدولاب: مفصلي\n\n'
        'مقاس المرتبة المناسبة للسرير: عرض: 160 سم عمق: 195 سم\n'
        '• متاح من السرير تصميم مقاسات اخري',
  ),
  Product(
    name: 'غرفة نوم يارن',
    newPrice: 20.000,
    imageUrl: 'https://www.kabbanifurniture.com/cdn/shop/products/1_506eb3cd-4c42-47bd-b24b-db9cab668afd_1800x1800.jpg?v=1612941841',
    description:   '• سرير\n'
        '• دولاب\n'
        '• عدد 2 كمود\n'
        '• تسريحة مع مرايا\n\n'
        'المواصفات:\n\n'
        'الخامات:\n'
        '• مصنع من الخشب السونتا بطريقة الـMDF\n'
        '• إكسسوارات مزوده بخاصية التجميع المعدني Mini Fix\n'
        '• طبقة ميلامين عازلة للرطوبة والحرارة والسوائل ومقاومة للحشرات\n\n'
        'الأبعاد:\n'
        '• السرير: عرض 160 سم طول 200 سم\n'
        '• ظهر السرير: عرض 205 سم إرتفاع 102 سم\n'
        '• الدولاب: عرض 200 سم إرتفاع 220 سم عمق 65 سم\n'
        '• التسريحة مع المرايا: عرض 120 سم إرتفاع بالمرايا 175 سم إرتفاع بدون المرايا 80 سم عمق 40 سم\n'
        '• الكمود: عرض 50 سم إرتفاع 37 سم عمق 40 سم\n\n'
        'مقاس المرتبة المناسبة للسرير: عرض: 160 سم عمق: 195 سم\n'
        'نوع الدولاب: جرار\n'
        'متاح تصميم مقاسات اخرى\n'

  ),
  Product(
    name: 'غرفة نوم موسكو',
    newPrice:18.990 ,
    imageUrl: 'https://www.kabbanifurniture.com/cdn/shop/files/2_6_1800x1800.jpg?v=1721207066',
    description: '• سرير\n'
        '• دولاب\n'
        '• عدد 2 كمود\n'
        '• تسريحة مع مرايا\n\n'
        'المواصفات:\n\n'
        'الخامات:\n'
        '• مصنع من الخشب السونتا بطريقة الـMDF\n'
        '• إكسسوارات مزوده بخاصية التجميع المعدني Mini Fix\n'
        '• طبقة ميلامين عازلة للرطوبة والحرارة والسوائل ومقاومة للحشرات\n\n'
        'الأبعاد:\n'
        '• السرير: عرض 160 سم إرتفاع 29.5 سم طول 212 سم\n'
        '• الدولاب: عرض 240 سم إرتفاع 212 سم عمق 56 سم\n'
        '• كمود: عرض 50 سم إرتفاع 46 سم عمق 42 سم\n'
        '• التسريحة بالمرايا: عرض 152 سم إرتفاع 173 سم عمق 43 سم\n\n'
        'مقاسات اخرى:\n'
        '• متاح من السرير مقاس 180 سم\n\n'
        'مقاس المرتبة المناسبة للسرير: عرض: 160 سم عمق: 195 سم\n'
        'نوع الدولاب: مفصلي\n'
        'متاح تصميم مقاسات اخرى\n',
  ),
  Product(
      name: 'غرفة نوم نيو جولد',
      newPrice:30.290 ,
      imageUrl: 'https://www.kabbanifurniture.com/cdn/shop/products/2_4bca0375-e321-4b1b-8060-b8572dad919e_1800x1800.jpg?v=1678022172',
      description: '• سرير\n'
          '• دولاب\n'
          '• عدد 2 كمود\n'
          '• تسريحة مع مرايا\n\n'
          'المواصفات:\n\n'
          'الخامات:\n'
          '• مصنع من الخشب السونتا بطريقة الـMDF\n'
          '• إكسسوارات مزوده بخاصية التجميع المعدني Mini Fix\n'
          '• طبقة ميلامين عازلة للرطوبة والحرارة والسوائل ومقاومة للحشرات\n\n'
          'الأبعاد:\n'
          '• السرير: عرض 160 سم طول 200 سم\n'
          '• ظهر السرير: عرض 275 سم أرتفاع 120 سم\n'
          '• الدولاب: عرض 240 سم إرتفاع 215 سم عمق 65 سم\n'
          '• التسريحة مع المرايا: عرض 150 سم إرتفاع بالمرايا 175 سم إرتفاع بدون مرايا 85 سم عمق 47 سم\n'
          '• الكمود: عرض 50 سم إرتفاع 40 سم عمق 47 سم\n\n'
          'مقاس المرتبة المناسبة للسرير: عرض: 160 سم عمق: 195 سم\n'
          'نوع الدولاب: مفصلي\n\n'
          'مقاسات اخرى:\n'
          '• متاح من السرير مقاس: 160 سم و 180 سم\n\n'
          'المواصفات الخاصة:\n'
          '• الدولاب به إضائه ليد\n'
      'متاح تصميم مقاسات اخرى\n',
  ),
  Product(
      name: 'غرفة نوم ليندا',
      newPrice: 20.000,
      imageUrl: 'https://www.kabbanifurniture.com/cdn/shop/products/1_e4f47af2-4cca-4be6-94e5-916875867fcb_1800x1800.jpg?v=1691504347',
      description:  '• سرير\n'
          '• دولاب\n'
          '• عدد 2 كمود\n'
          '• تسريحة مع مرايا\n\n'
          'المواصفات:\n\n'
          'الخامات:\n'
          '• مصنع من الخشب السونتا بطريقة الـMDF\n'
          '• إكسسوارات مزوده بخاصية التجميع المعدني Mini Fix\n'
          '• طبقة ميلامين عازلة للرطوبة والحرارة والسوائل ومقاومة للحشرات\n\n'
          'الأبعاد:\n'
          '• السرير: عرض 160 سم طول 200 سم\n'
          '• الدولاب: عرض 240 سم إرتفاع 220 سم\n'
          '• التسريحة مع المرايا: عرض 120 سم عمق 40 سم\n'
          '• الكمود: عرض 50 سم عمق 40 سم\n\n'
          'مقاس المرتبة المناسبة للسرير: عرض: 160 سم عمق: 195 سم\n'
          'نوع الدولاب: مفصلي\n'
          'متاح تصميم مقاسات اخرى\n',
  ),
  Product(
      name: 'غرفة نوم صوفا',
      newPrice: 30.990,
      imageUrl: 'https://www.kabbanifurniture.com/cdn/shop/files/1_ab298b0e-6cf7-4000-96fb-63c61c29854e_1800x1800.jpg?v=1710243059',
      description: '• سرير\n'
          '• دولاب\n'
          '• عدد 2 كمود\n'
          '• تسريحة مع مرايا\n\n'
          'المواصفات:\n\n'
          'الخامات:\n'
          '• مصنع من الخشب السونتا بطريقة الـMDF\n'
          '• إكسسوارات مزوده بخاصية التجميع المعدني Mini Fix\n'
          '• طبقة ميلامين عازلة للرطوبة والحرارة والسوائل ومقاومة للحشرات\n\n'
          'المواصفات الخاصة:\n'
          '• الدولاب به إضاءة ليد\n\n'
          'الأبعاد:\n'
          '• السرير: عرض 238 سم إرتفاع 30 سم عمق 202 سم\n'
          '• الدولاب: عرض 240 سم إرتفاع 214 سم عمق 56 سم\n'
          '• التسريحة مع المرايا: عرض 121 سم إرتفاع بالمرايا 179 سم إرتفاع بدون مرايا 80 سم عمق 45 سم\n'
          '• الكمود: عرض 50 سم إرتفاع 39 سم عمق 45 سم\n\n'
          'نوع الدولاب: مفصلي\n'
      'متاح تصميم مقاسات اخرى\n',
  ),

];
final List<Product> kidsRoomProducts = [
  Product(
    name: 'غرفة اطفال تيفاني',
    newPrice: 18.580,
    imageUrl: 'https://www.kabbanifurniture.com/cdn/shop/products/Kabbani-bedrom-Tefani_82f5f1ed-6284-4d65-aab0-26a7b8dbb557_1800x1800.jpg?v=1637696862',
    description:   'سرير\n'
        'دولاب\n'
        'كمود\n'
        'تسريحة بالمرايا\n\n'
        'المواصفات:\n\n'
        'الخامات:\n'
        '• مصنع من الخشب السونتا بطريقة الـMDF\n'
        '• إكسسوارات مزودة بخاصية التجميع المعدني Mini Fix\n'
        '• طبقة ميلامين عازلة للرطوبة والحرارة والسوائل ومقاومة للحشرات\n\n'
        'الأبعاد:\n'
        '• السرير: عرض: 120 سم، طول: 200 سم\n'
        '• ظهر السرير: عرض: 152 سم، ارتفاع: 125 سم\n'
        '• الدولاب: عرض: 140 سم، ارتفاع: 220 سم، عمق: 63 سم\n'
        '• الكمود: عرض: 50 سم، ارتفاع: 65 سم، عمق: 45 سم\n'
        '• التسريحة مع المرايا: عرض: 92 سم، ارتفاع مع المرايا: 194 سم، ارتفاع بدون المرايا: 100 سم، عمق: 45 سم\n\n'
        'مقاس المرتبة المناسبة للسرير:\n'
        '• عرض: 120 سم، عمق: 195 سم\n\n'
        'نوع الدولاب: مفصلي\n'
        'يمكن إضافة مكتب: عرض 120 سم\n\n'
        'مقاسات أخرى:\n'
        '• متاح تنفيذ مقاسات اخري',
  ),
  Product(
    name: 'غرفة اطفال يارن ',
    newPrice: 17.910,
    imageUrl: 'https://www.kabbanifurniture.com/cdn/shop/products/yarn_1800x1800.jpg?v=1620806955',
    description: 'سرير\n'
        'دولاب\n'
        'كمود\n'
        'تسريحة بالمرايا\n\n'
        'المواصفات:\n\n'
        'الخامات:\n'
        '• مصنع من الخشب السونتا بطريقة الـMDF\n'
        '• إكسسوارات مزودة بخاصية التجميع المعدني Mini Fix\n'
        '• طبقة ميلامين عازلة للرطوبة والحرارة والسوائل ومقاومة للحشرات\n\n'
        'الأبعاد:\n'
        '• السرير: عرض 120 سم، طول 200 سم\n'
        '• الدولاب: عرض 200 سم، ارتفاع 210 سم\n'
        '• الكمود: عرض 55 سم، عمق 45 سم\n'
        '• تسريحة مع المرايا: عرض 120 سم، ارتفاع 40 سم\n\n'
        'مقاس المرتبة المناسبة للسرير:\n'
        '• عرض 120 سم، عمق 195 سم\n\n'
        'نوع الدولاب: جرار\n'
        'يمكن إضافة وحدة أدراج: عرض 70 سم\n'
        'يمكن إضافة وحدة دولاب: عرض 40 سم\n\n'
        'مقاسات أخرى:\n'
        '• متاح من السرير مقاسات اخري.',
  ),
  Product(
    name: 'غرفة اطفال تيفاني دورين',
    newPrice: 20.220,
    imageUrl: 'https://www.kabbanifurniture.com/cdn/shop/files/2_4_1800x1800.jpg?v=1721050136',
    description:'140 سم دولاب مفصلي\n'
        'مكتب بـ رف\n'
        'سرير علوي\n'
        'سرير سفلي\n'
        'سرير أسفل السرير السفلي في الدرج\n'
        'عدد 4 وحدة تخزين داخل السلم\n\n'
        'مصنعة من:\n'
        '• خشب SONTA بطريقة MDF\n'
        '• إكسسوارات مزودة بخاصية تجميع Mini Fix لجميع الوحدات\n'
        '• سهولة الفك والتركيب أكثر من مرة وعمر أطول للغرفة\n'
        '• مضاف إليها طبقة ميلامين عازلة للرطوبة والحرارة والسوائل\n'
        '• مقاومة للحشرات والتسوس\n\n'
        'الأبعاد:\n'
        '• عرض كلي: 250 سم\n'
        '• ارتفاع كلي: 200 سم\n'
        '• السرير العلوي: 120 * 195 سم\n'
        '• السرير السفلي: 120 * 195 سم\n'
        '• الدولاب: 140 سم\n'
        '• مكتب: 120 سم',
  ),
  Product(
    name: 'غرفة كابرس ',
    newPrice: 15.990,
    imageUrl: 'https://www.kabbanifurniture.com/cdn/shop/files/19_7a7509a6-651d-45d9-8414-74bd41f33a46_1800x1800.jpg?v=1695475254',
    description:   'سرير\n'
        'دولاب\n'
        'كمود\n\n'
        'المواصفات:\n\n'
        'الخامات:\n'
        '• مصنع من الخشب السونتا بطريقة الـMDF\n'
        '• إكسسوارات مزودة بخاصية التجميع المعدني Mini Fix\n'
        '• طبقة ميلامين عازلة للرطوبة والحرارة والسوائل ومقاومة للحشرات\n\n'
        'الأبعاد:\n'
        '• السرير: عرض: 100 سم، طول: 200 سم\n'
        '• ظهر السرير: عرض: 105 سم، ارتفاع: 105 سم\n'
        '• الدولاب: عرض: 120 سم، ارتفاع: 200 سم، عمق: 56 سم\n'
        '• الكمود: عرض: 55 سم، ارتفاع: 40 سم، عمق: 45 سم\n\n'
        'مقاس المرتبة المناسبة للسرير:\n'
        '• عرض: 100 سم، عمق: 195 سم\n\n'
        'نوع الدولاب: مفصلي\n'
        'يمكن إضافة مكتب: عرض 110 سم، ارتفاع 72 سم، عمق 60 سم\n'
        'يمكن إضافة مرآة مكتب\n\n'
        'مقاسات أخرى:\n'
        '• متاح من السرير مقاسات إضافية.',
  ),
  Product(
    name: 'غرفة اطفال سيتي',
    newPrice: 16.150,
    imageUrl: 'https://www.kabbanifurniture.com/cdn/shop/files/4_4381dbfd-b828-45bd-8472-542888947e95_1800x1800.jpg?v=1723285709',
    description:  'عدد 2 سرير\n'
        'دولاب 120 سم\n'
        'مكتب 110 سم\n'
        'كمود\n\n'
        'المواصفات:\n\n'
        'الخامات:\n'
        '• مصنع من الخشب السونتا بطريقة الـMDF\n'
        '• إكسسوارات مزودة بخاصية التجميع المعدني Mini Fix\n'
        '• طبقة ميلامين عازلة للرطوبة والحرارة والسوائل ومقاومة للحشرات\n\n'
        'الأبعاد:\n'
        '• السرير 1: عرض 105 سم إرتفاع 29.5 سم عمق 200 سم\n'
        '• السرير 2: عرض 125 سم إرتفاع 29.5 سم عمق 200 سم\n'
        '• الدولاب: عرض 120 سم إرتفاع 196 سم عمق 56 سم\n'
        '• الكمود: عرض 50 سم إرتفاع 35 سم عمق 40 سم\n'
        '• التسريحة مع المرايا: عرض 75 سم إرتفاع 158 سم عمق 40 سم\n\n'
        'نوع الدولاب: مفصلي\n'
        'مقاس المرتبة المناسبة للسرير 1: عرض 100 سم طول 195 سم\n'
        'مقاس المرتبة المناسبة للسرير 2: عرض 120 سم طول 195 سم\n\n'
        'متاح تنفيذ مقاسات اخري',
  ),
  Product(
    name: 'غرفة اطفال مقبض',
    newPrice:19.300,
    imageUrl: 'https://wuilt-assets-v2-dev.s3.amazonaws.com/cl2bca2p801du396zt1z5a24s_IMG-20210928-WA0052.jpg',
    description: '\nالغرفة مُصنعة بالكامل من الخامات الطبيعية 100% حيث أن'
        ' القوائم من الأخشاب الزان الروماني الأحمر، والمسحطات \n'
        'من الأبلاكاش ال ث الروسي 3 مم بتقنية الكبس الحراري.\n\n'
        'مُكونات الغرفة:\n\n'
        '- 2 سرير 120 سم\n'
        '- دولاب 200 سم\n'
        '- تسريحة 120 سم\n'
        '- كمود 55 سم\n\n'
        'ملحوظة: مُتاح تعديل المقاسات، تغيير الألوان، تبديل الأقمشة وطرق\n '
        '\nالتنجيد، بالإضافة إلى المساعدة بالعديد من الأفكار الإبداعية'
        ' للتغلب على مشاكل (ضيق المساحة، الزوايا الغير قائمة، الأعمدة البارزة.....).\n',
  ),
  Product(
      name: 'غرفه اطفال-SAM1',
      newPrice:20.000 ,
      imageUrl: 'https://chichomz.com/cdn/shop/files/C2_bf16c0fc-f949-40cb-bb1b-1ec3e851581f.jpg?v=1718026208&width=1100',
      description: 'عدد القطع:4 (2سرير + دولاب + كومود)\n\n'
          'السرير:\n'
          '- الطول: 200 سم\n'
          '- العرض: 120 سم\n'
          '- ارتفاع الظهر: 120 سم\n'
          '- ارتفاع الجنب: 30 سم\n\n'
           'خشب:كونتر\n'
          'الدولاب:\n'
          '- العرض: 160 سم\n'
          '- الارتفاع: 220 سم\n'
          '- العمق: 190 سم\n\n'
          'الكومود:\n'
          '- العرض: 45 سم\n'
          '- الطول: 50 سم\n'
          '- العمق: 40 سم',
  ),
  Product(
      name: 'غرفه اطفال سما',
      newPrice:19.000 ,
      imageUrl: 'https://www.kabbanifurniture.com/cdn/shop/products/Sama-100_1800x1800.jpg?v=1694685328',
      description: 'عدد القطع: سرير + دولاب + كمود + تسريحة + مرايا\n\n'
          'المواصفات:\n\n'
          'الخامات:\n'
          '- مصنع من الخشب السونتا بطريقة الـMDF\n'
          '- إكسسوارات مزوده بخاصية التجميع المعدني Mini Fix\n'
          '- طبقة ميلامين عازلة للرطوبة والحرارة والسوائل ومقاومة للحشرات\n\n'
          'الأبعاد:\n'
          '- السرير: عرض 120 سم، طول 200 سم\n'
          '- ظهر السرير: عرض 105 سم، ارتفاع 105 سم\n'
          '- الدولاب: عرض 120 سم، ارتفاع 200 سم، عمق 60 سم\n'
          '- الكمود: عرض 50 سم، ارتفاع 40 سم، عمق 40 سم\n'
          '- تسريحة بالمرايا: عرض 90 سم، ارتفاع بالمرايا 170 سم، ارتفاع بدون المرايا 82 سم، عمق 40 سم\n\n'
          'مقاس المرتبة المناسبة للسرير: عرض 120 سم، عمق 195 سم\n'
          'نوع الدولاب: مفصلي\n'
          'يمكن إضافة مكتب: عرض 120 سم\n\n'
    'متاح تنفيذ مقاسات اخري واضافه قطع اخري .',
  ),
];
final List<Product> tablesProducts = [
  Product(
    name: 'ترابيزة تليفزيون ',
    newPrice: 2.000,
    imageUrl: 'https://www.kabbanifurniture.com/cdn/shop/products/gtv120L_1800x1800.jpg?v=1618990375',
    description:'تحتوي على أدراج لوضع الأجهزة الكهربائية\n'
        'مناسبة لمساحات التليفزيون الكبيرة\n'
        'مزودة بفتحات من الخلف لخروج الأسلاك\n\n'
        'الخامة الأساسية:\n'
        'ألواح خشبية مضغوطة SONTA عالية الكثافة\n'
        'اكسسوارات تجميع معدنية MiNi FiX لجميع الوحدات\n\n'
        'مميزاتها:\n'
        '- مقاومة للحشرات والتسوس\n'
        '- لا تتمدد ولا تنكمش\n'
        '- مقاومة للحرارة والرطوبة\n'
        '- ثبات لدرجة اللون\n\n'
        'الأبعاد:\n'
        '120 * 40 * 38 cm',
  ),
  Product(
    name: 'وحدة تلفزيون أتلانتا',
    newPrice: 3.000,
    imageUrl:'https://www.kabbanifurniture.com/cdn/shop/files/6F4A9355-copy_1800x1800.jpg?v=1711456834',
    description:
    'تحتوي على أدراج ودرف لوضع الأجهزة الكهربائية\n'
        'الخامة الأساسية:\n'
        'خشب SONTA بطريقة MDF\n'
        'اكسسوارات مزودة بخاصية تجميع Mini fix لجميع الوحدات\n'
        'لسهولة الفك والتركيب أكثر من مرة وعمر أطول للغرفة\n'
        'مضاف إليه طبقة ملامين عازلة للرطوبة والحرارة والسوائل\n'
        'مقاومة للحشرات والتسوس\n\n'
        'الأبعاد:\n'
        'طول: 180 سم\n'
        'عمق: 53 سم\n'
        'ارتفاع: 62 سم',
  ),
  Product(
    name: 'ترابيزة تليفزيون',
    newPrice: 2.390,
    imageUrl: 'https://www.kabbanifurniture.com/cdn/shop/files/GTV4_1800x1800.jpg?v=1711184547',
    description: '• تحتوي علي أدراج لوضع الاجهزة الكهربية\n'
        '• مناسبة لمساحات التليفزيون الكبيرة\n'
        '• مزودة بفتحات من الخلف لخروج الأسلاك\n'
        '• 3 ترابيزات متداخلة سهلة نقلها\n\n'
        '• مصنعة من\n'
        '• خشب SONTA بطريقه MDF\n'
        '• اكسسوارات مزودة بخاصيه تجميع Mini fix لجميع الوحدات لسهوله الفك والتركيب اكثر من مره وعمر أطول للغرفه\n'
        '• مضاف اليه طبقه ملامين عازله للرطوبه والحراره والسوائل مقاومة للحشرات والتسوس\n\n'
        '• الأبعاد\n'
        '• 180W * 42D * 54H cm',
  ),
  Product(
    name: 'ترابيزة وسط بابلي',
    newPrice: 2.490,
    imageUrl: 'https://www.kabbanifurniture.com/cdn/shop/products/da97980a50cbc3528faeb66e88f94066_1800x1800.jpg?v=1711276554',
    description:  '• ستانليس بيور (معدن) لون ذهبي\n'
        '• طلاء PVD مقاوم للصدأ\n'
        '• زجاج سيكوريت مقاوم للكسر',
  ),
  Product(
    name: 'ترابيزة وسط G1',
    newPrice: 900,
    imageUrl: 'https://www.kabbanifurniture.com/cdn/shop/products/G1-middle-table-kabbani-_1_1800x1800.jpg?v=1584194082',
    description:'• MDF\n'
        '• طلاء عالي الجودة\n\n'
        'ضمان\n'
        '• 3 سنوات\n\n'
        'الأبعاد\n'
        '• طول 100 سم\n'
        '• عرض 50 سم\n'
        '• ارتفاع 45 سم',
  ),
  Product(
      name: 'وحدة تلفزيون سفير',
      newPrice: 2.990,
      imageUrl: 'https://www.kabbanifurniture.com/cdn/shop/files/5_830eac8b-742a-4201-824b-0f1628eaed58_1800x1800.jpg?v=1719584178',
      description: '• تحتوي على أدراج ودرف لوضع الأجهزة الكهربائية\n\n'
          'الخامة الأساسية\n'
          '• خشب SONTA بطريقة MDF\n'
          '• إكسسوارات مزودة بخاصية تجميع Mini Fix لجميع الوحدات\n'
          '• لسهولة الفك والتركيب أكثر من مرة وعمر أطول للغرفة\n'
          '• مضاف إليه طبقة ملامين عازلة للرطوبة والحرارة والسوائل\n'
          '• مقاومة للحشرات والتسوس\n\n'
          'الأبعاد\n'
          '• عرض 180 سم\n'
          '• عمق 52 سم\n'
          '• ارتفاع 58 سم',
  ),
  Product(
      name: 'ترابيزة تليفزيون',
      newPrice: 1.690,
      imageUrl: 'https://www.kabbanifurniture.com/cdn/shop/products/GTV160-L_1800x1800.jpg?v=1618990374',
      description:  'تحتوي على أدراج لوضع الأجهزة الكهربائية\n'
          'مناسبة لمساحات التلفزيون الكبيرة\n'
          'مزودة بفتحات من الخلف لخروج الأسلاك\n\n'
          'الخامة الأساسية:\n'
          'ألواح خشبية مضغوطة SONTA عالية الكثافة\n'
          'إكسسوارات تجميع معدنية Mini FiX لجميع الوحدات\n\n'
          'مميزاتها:\n'
          '• مقاومة للحشرات والتسوس\n'
          '• لا تتمدد ولا تنكمش\n'
          '• مقاومة للحرارة والرطوبة\n'
          '• ثبات لدرجة اللون\n\n'
          'الأبعاد:\n'
          '160 * 40 * 38 سم',
  ),
  Product(
      name: 'ترابيزة وسط T-16',
      newPrice: 3.590,
      imageUrl: 'https://www.kabbanifurniture.com/cdn/shop/files/2_02b4b70d-3ee1-4155-b713-7c4e261cc007_1800x1800.jpg?v=1695571050',
      description: '• مكون من\n'
          '  • ترابيزه وسط\n'
          '  • 2 بوف بوحده تخزين\n'
          '  • 2 ترابيزه شاى\n\n'
          '• مصنع من\n'
          '  • خشب طبيعي ذو متانة عالية وعملية معالج ضد التسوس والحشرات\n'
          '  • بوف قماش جلدي\n'
          '  • إسفنج ذو كثافة عالية مما يجعله أكثر راحة\n\n'
          '• الأبعاد\n'
          '  • ترابيزه وسط مقاس : 120W x 80D cm\n'
          '  • 2 ترابيزه شاى مقاس : 35W × 35D cm\n'
          '  • 2 بوف مقاس : 75W × 38D cm',
  ),

];
final List<Product> tableshoosProducts = [
  Product(
    name: 'جزامة SHK-2',
    newPrice: 1.990,
    imageUrl: 'https://www.kabbanifurniture.com/cdn/shop/products/6_2705279c-f2ad-4554-a6f2-f2adc4c4191e_1800x1800.jpg?v=1668603005',
    description:'. ضلف كبيرة تسع لعدد كبير من الاحذية\n'
        '. إكسسوارات معدنية ذات جوده عالية\n'
        '. الخامة الأساسية\n\n'
        '. اللواح خشبية مضغوطة SONTA عالى الكثافة\n'
        '. اكسسوارات تجميع معدنى MiNi FiX لجميع الوحدات\n\n'
        '. مميزاتها\n\n'
        '. مقاومة للحشرات والتسوس\n'
        '. لا تتمدد ولا تنكمش\n'
        '. مقاومة للحراره والرطوبة\n'
        '. ثبات لدرجة اللون\n\n'
        '. الأبعاد\n\n'
        '. 90W * 30D * 130H',
  ),
  Product(
    name: 'جزامة ستار',
    newPrice: 2.190,
    imageUrl:'https://www.kabbanifurniture.com/cdn/shop/products/3_c91ea627-626d-4d61-b5af-a4cba6b93c10_1800x1800.jpg?v=1668602922',
    description: '• تحتوى على درج للأحتفاظ بالأغراض المختلفة\n'
        '• ضلف كبيرة تسع لعدد كبير من الاحذية\n'
        '• أرفف جانبية\n\n'
        '• الخامة الأساسية\n'
        '• MDF\n'
        '• إكسسوارات معدنية ذات جوده عالية\n\n'
        '• الأبعاد\n'
        '• 120W * 40D * 120H',
  ),
  Product(
    name: 'جزامة بورت شابوه',
    newPrice: 2.990,
    imageUrl: 'https://www.kabbanifurniture.com/cdn/shop/products/KSH-601_1800x1800.jpg?v=1679052425',
    description: 'يحتوى على درج للأحتفاظ بالأغراض المختلفة\n'
        '3 ضلفة تسع لعدد كبير من الاحذية\n'
        'رف سفلي\n'
        'الخامة الأساسية\n'
        'إكسسوارات معدنية ذات جوده عالية\n\n'
        'الأبعاد:\n'
        'عرض 140 سم\n'
        'طول 120 سم\n'
        'عمق 40 سم',
  ),
  Product(
    name: 'جزامة بورت شابوه',
    newPrice: 3.990,
    imageUrl: 'https://www.kabbanifurniture.com/cdn/shop/products/1_38acf26b-97ec-4da4-a681-ef1243b00bcc_1800x1800.jpg?v=1609500709',
    description:  'درج للأحتفاظ بالأغراض المختلفة\n'
        'ضلفة كبيرة تسع لعدد كبير من الاحذية\n'
        'درجان للتخزين\n'
        'الخامة الأساسية: MDF\n'
        'إكسسوارات معدنية ذات جوده عالية',
  ),
  Product(
    name: 'جزامة بورت شابوه',
    newPrice: 2.990,
    imageUrl: 'https://www.kabbanifurniture.com/cdn/shop/products/3_084d635c-659c-4475-97b4-79a7a4ffb8d5_1800x1800.jpg?v=1609500708',
    description:'درج للأحتفاظ بالأغراض المختلفة\n'
        'ضلف كبيرة تسع لعدد كبير من الاحذية\n'
        'درج للتخزين\n'
        'إكسسوارات معدنية ذات جوده عالية\n'
        'الخامة الأساسية: MDF\n'
        'الأبعاد: 90W * 40D * 120H',
  ),
  Product(
    name: 'جزامة بورت شابوه',
    newPrice: 3.990,
    imageUrl: 'https://www.kabbanifurniture.com/cdn/shop/products/KSH-609_1800x1800.jpg?v=1659019441',
    description: 'ضلف كبيرة تسع لعدد كبير من الأحذية\n'
        'درج للتخزين\n'
        'إكسسوارات تركيب معدنية ذات جودة عالية\n'
        'الخامة الأساسية: MDF\n'
        'الأبعاد: 120W * 35D * 120H',
  ),
  Product(
    name: 'جزامة تيفاني دورين',
    newPrice: 4.990,
    imageUrl: 'https://www.kabbanifurniture.com/cdn/shop/files/9c2d434f4c730ea1d87e460efc02792c_1800x1800.jpg?v=1709480267',
    description:  'ضلف كبيرة تسع لعدد كبير من الأحذية\n'
        'بها درجين للتخزين\n'
        'إكسسوارات تركيب معدنية ذات جودة عالية\n\n'
        'المواصفات:\n\n'
        'الخامات:\n'
        'MDF\n\n'
        'الأبعاد:\n'
        'عرض 100 سم إرتفاع 200 سم عمق 40 سم',
  ),
  Product(
    name: 'جزامة تيفاني',
    newPrice: 7.490,
    imageUrl: 'https://www.kabbanifurniture.com/cdn/shop/products/4_eb04146d-4bea-4243-a4f8-8001c5ea6952_1800x1800.jpg?v=1668602956',
    description:  'ضلف كبيرة تسع لعدد كبير من الأحذية\n'
        'درج للتخزين\n'
        'إكسسوارات تركيب معدنية ذات جودة عالية\n\n'
        'الخامة الأساسية:\n'
        'MDF\n\n'
        'الأبعاد:\n'
        '100W * 35D * 120H',
  ),

];
final List<Product> livingroomProducts = [
  Product(
    name: 'أنتريه ماكس',
    newPrice: 12.990,
    imageUrl: 'https://www.kabbanifurniture.com/cdn/shop/files/2.._1800x1800.jpg?v=1725362367',
    description: 'كنبة ثلاثية\n'
        'كنبة ثنائية\n'
        'فوتيه\n\n'
        'المواصفات:\n\n'
        'الخامات:\n'
        '• خشب الزان الطبيعي.\n'
        '• قماش كتان و شمواة عالي الجودة.\n\n'
        'الألوان:\n'
        '• لون القماش: بيج*بني.\n'
        '• لون الخشب: بني فاتح.\n\n'
        'الأبعاد:\n'
        '• الكنبة الثلاثية: عرض 220 سم.\n'
        '• الكنبة الثنائية: عرض 180 سم.\n'
        '• الفوتيه: عرض 100 سم.',
  ),
  Product(
      name: 'أنتريه كازا',
      newPrice: 11.990,
      imageUrl: 'https://www.kabbanifurniture.com/cdn/shop/files/1_4bcc3262-34e8-41ff-adec-67300721de60_1800x1800.jpg?v=1715864011',
      description:'عدد 2 كنبة ثلاثية\n'
          'فوتيه\n\n'
          'المواصفات:\n\n'
          'الخامات:\n'
          '• خشب الزان الطبيعي.\n'
          '• سوست و إسفنج أسفل المقاعد.\n'
          '• قماش جلد مقلوب.\n\n'
          'الألوان:\n'
          '• لون القماش: بيج.\n'
          '• لون الخشب: بني.\n\n'
          'الألوان المتاحة:\n'
          '• بيج - بني - أصفر - زيتي - توتي - رمادي.\n\n'
          'الأبعاد:\n'
          '• الكنبة الثلاثية قبل الفتح: عرض 215 سم، ارتفاع 80 سم، عمق 90 سم.\n'
          '• الكنبة الثلاثية بعد الفتح: عرض 215 سم، ارتفاع 80 سم، عمق 100 سم.\n'
          '• الفوتيه: عرض 85 سم، ارتفاع 90 سم، عمق 75 سم.',
  ),
  Product(
      name: 'صالون لوريان',
      newPrice: 15.200,
      imageUrl: 'https://www.kabbanifurniture.com/cdn/shop/files/3_1_0cf725ea-a702-4ec5-8b1f-5f686cb9fa39_1800x1800.jpg?v=1716815882',
      description:  'كنبة ثنائية\n'
          'عدد 2 فوتيه\n'
          'ترابيزة وسط\n'
          'عدد 2 ترابيزة جنب\n\n'
          'المواصفات:\n\n'
          'الخامات:\n'
          '• خشب الزان الطبيعي.\n'
          '• قماش قطيفة عالي الجودة.\n\n'
          'الألوان:\n'
          '• لون القماش: سماوي أو بيج.\n'
          '• لون الخشب: شامبين.\n\n'
          'الأبعاد:\n'
          '• الكنبة الثنائية: عرض 140 سم، ارتفاع 95 سم، عمق 65 سم.\n'
          '• الفوتيه: عرض 65 سم، ارتفاع 90 سم، عمق 70 سم.\n'
          '• ترابيزة الوسط: عرض 95 سم، عمق 50 سم.\n'
          '• ترابيزة جنب: 45 سم * 45 سم.',
  ),
  Product(
      name: 'أنتريه سكاي',
      newPrice: 12.220,
      imageUrl: 'https://www.kabbanifurniture.com/cdn/shop/files/3_cb5a0fd7-a141-4fc2-8cc4-523961002a10_1800x1800.jpg?v=1701103088',
      description:'كنبة ثلاثية\n'
          'كنبة ثنائية\n'
          'فوتيه\n\n'
          'المواصفات:\n\n'
          'الخامات:\n'
          '• خشب الزان الطبيعي.\n'
          '• قماش كتان عالي الجودة.\n\n'
          'الألوان:\n'
          '• لون القماش: روز*بيج.\n'
          '• لون الخشب: بني فاتح.\n\n'
          'الأبعاد:\n'
          '• الكنبة الثلاثية: عرض 215 سم، ارتفاع 92 سم، عمق 90 سم.\n'
          '• الكنبة الثنائية: عرض 160 سم، ارتفاع 92 سم، عمق 90 سم.\n'
          '• الفوتيه: عرض 75 سم، ارتفاع 98 سم، عمق 85 سم.',
  ),
  Product(
      name: 'أنتريه كوبا',
      newPrice:9.990 ,
      imageUrl: 'https://www.kabbanifurniture.com/cdn/shop/files/05_1800x1800.jpg?v=1700757948',
      description: 'عدد 2 كنبة ثلاثية\n'
          'فوتيه\n\n'
          'المواصفات:\n\n'
          'الخامات:\n'
          '• خشب الزان الطبيعي.\n'
          '• قماش كتان مع جلد مقلوب.\n\n'
          'الألوان:\n'
          '• لون القماش: بيج*بني.\n'
          '• لون الخشب: بني فاتح.\n\n'
          'المواصفات الخاصة:\n'
          '• الكنبة بظهر متحرك لعمق أكثر.\n\n'
          'الأبعاد:\n'
          '• الكنبة الثلاثية قبل الفتح: عرض 225 سم، ارتفاع 78 سم، عمق 90 سم.\n'
          '• الكنبة الثلاثية بعد الفتح: عرض 225 سم، ارتفاع 72 سم، عمق 90 سم.\n'
          '• الفوتيه: عرض 90 سم، ارتفاع 82 سم، عمق 85 سم.',
  ),
  Product(
      name: 'ركنة ڤيرا',
      newPrice:10.990 ,
      imageUrl: 'https://www.kabbanifurniture.com/cdn/shop/files/4_6_1800x1800.jpg?v=1722778595',
      description:  'خشب الزان الطبيعي\n'
          'قماش كتان عالي الجودة\n'
          'إسفنج سوفت\n\n'
          'الألوان:\n'
          '• لون القماش: كافيه\n\n'
          'الألوان المتاحة:\n'
          '• كافيه و بترولي\n\n'
          'الأبعاد:\n'
          '• عرض: 290 سم، ارتفاع: 65 سم، عمق: 180 سم.',
  ),
  Product(
      name: 'أنتريه أوبرا',
      newPrice:13.990 ,
      imageUrl: 'https://www.kabbanifurniture.com/cdn/shop/files/4_27f046a6-d4de-4b38-9cfb-0c4a657a6bd8_1800x1800.jpg?v=1710240473',
      description:'كنبة ثلاثية\n'
          'كنبة ثنائية\n'
          'فوتيه\n\n'
          'المواصفات:\n\n'
          'الخامات:\n'
          '• خشب الزان الطبيعي\n'
          '• قماش جلد مقلوب\n'
          '• إسفنج سوفت 30 سم\n'
          '• الأرجل معدن\n\n'
          'الألوان:\n'
          '• لون القماش: أوف وايت\n'
          '• لون الخشب: بني فاتح\n\n'
          'الأبعاد:\n'
          '• الكنبة الثلاثية: عرض: 217 سم، ارتفاع: 74 سم، عمق: 90 سم\n'
          '• الكنبة الثنائية: عرض: 187 سم، ارتفاع: 74 سم، عمق: 90 سم\n'
          '• الفوتيه: عرض: 72 سم، ارتفاع: 98 سم، عمق: 73 سم.',
  ),
  Product(
      name: ' ركنة نايس',
      newPrice: 10.990,
      imageUrl: 'https://www.kabbanifurniture.com/cdn/shop/products/15be494b66891c9c42b928f0f7f70cca_1800x1800.jpg?v=1678023747',
      description:'خشب الزان الطبيعي\n'
          'قماش كتان\n'
          'إسفنج متوسط الكثافة\n'
          'فايبر ذو كثافة عالية\n\n'
          'الألوان:\n'
          '• لون القماش: كافيه\n'
          '• لون الخشب: بني فاتح\n\n'
          'الألوان المتاحة:\n'
          '• كافيه\n'
          '• بني\n'
          '• أزرق\n'
          '• أصفر\n'
          '• رمادي',
  ),
];
final List<Product> diningProducts = [
  Product(
    name: 'غرفة سفرة مرمر',
    newPrice:10.000 ,
    imageUrl: 'https://www.kabbanifurniture.com/cdn/shop/files/3_d7aa2af0-a255-4dd9-a917-ed68390a24f6_1800x1800.jpg?v=1721906914',
    description: 'ترابيزة سفرة\n'
        'عدد 6 كراسي\n'
        'نيش\n'
        'بوفيه\n\n'
        'الخامات:\n'
        '• ترابيزة السفرة مصنعة من الخشب السونتا بطريقة الـMDF.\n'
        '• كراسي السفرة مصنعة من الخشب الزان الطبيعي.\n'
        '• إكسسوارات مزودة بخاصية التجميع المعدني Mini Fix.\n'
        '• طبقة ميلامين عازلة للرطوبة والحرارة والسوائل ومقاومة للحشرات.\n'
        'المواصفات الخاصة:\n'
        '• ترابيزة السفرة بها وحدتين تخزين.\n'
        'الأبعاد:\n'
        '• ترابيزة السفرة: طول 180 سم.\n'
        '• البوفيه: عرض 200 سم.\n'
        '• نيش: عرض 50 سم.\n\n'
        'متاح تصميم مقاسات أخرى :\n'
        '• متاح إضافة كراسي.',
  ),
  Product(
      name: 'غرفة سفرة أتلانتا',
      newPrice: 10.990,
      imageUrl: 'https://www.kabbanifurniture.com/cdn/shop/files/11_b5804ca5-dcc9-4928-b648-f3e9921a67ba_1800x1800.jpg?v=1695137703',
      description:'ترابيزة سفرة\n'
          '6 كراسي\n'
          'نيش\n'
          'بوفيه\n'
          'مرايه بوفيه\n\n'
          'الخامات:\n'
          '• ترابيزة السفرة مصنعة من الخشب السونتا بطريقة الـMDF.\n'
          '• كراسي السفرة مصنعة من الخشب الزان الطبيعي.\n'
          '• إكسسوارات مزودة بخاصية التجميع المعدني Mini Fix.\n'
          '• طبقة ميلامين عازلة للرطوبة والحرارة والسوائل ومقاومة للحشرات.\n\n'
          'المواصفات الخاصة:\n'
          '• النيش و البوفيه مزودين بإضاءة ليد.\n\n'
          'الأبعاد:\n'
          '• ترابيزة السفرة: طول 205 سم عرض 105 سم.\n'
          '• كراسي: عرض 65 سم عمق 70 سم.\n'
          '• البوفيه: عرض 200 سم عمق 55 سم.\n'
          '• النيش: عرض 80 سم عمق 50 سم.\n\n'
          'ممكن إضافة عدد من الكراسي.\n\n'
          'متاح تصميم مقاسات أخرى:\n'

  ),
  Product(
      name: 'غرفة سفرة باريس ',
      newPrice: 8.190,
      imageUrl: 'https://www.kabbanifurniture.com/cdn/shop/products/Paris_1800x1800.jpg?v=1658914447',
      description:'ترابيزة سفرة\n'
          'عدد 6 كراسي\n'
          'نيش\n'
          'بوفيه\n'
          'مرايه بوفيه\n\n'
          'الخامات:\n'
          '• ترابيزة السفرة مصنعة من الخشب السونتا بطريقة الـMDF.\n'
          '• كراسي السفرة مصنعة من الخشب الزان الطبيعي.\n'
          '• إكسسوارات مزودة بخاصية التجميع المعدني Mini Fix.\n'
          '• طبقة ميلامين عازلة للرطوبة والحرارة والسوائل ومقاومة للحشرات.\n\n'
          'الأبعاد:\n'
          '• ترابيزة السفرة: طول 180 سم عرض 90 سم إرتفاع 80 سم.\n'
          '• البوفيه: عرض 180 سم إرتفاع بالمرايا 150 سم إرتفاع بدون المرايا 90 سم عمق مقفول 50 سم عمق مفتوح 100 سم.\n'
          '• النيش: عرض 90 سم إرتفاع 175 سم عمق 45 سم.\n\n'
          'متاح تصميم مقاسات اخري:\n'
          'يمكن إضافة عدد من الكراسي.',
  ),
  Product(
      name: 'غرفة سفرة ريو',
      newPrice: 9.500,
      imageUrl: 'https://www.kabbanifurniture.com/cdn/shop/files/Rio_1800x1800.jpg?v=1699347404',
      description: 'ترابيزة سفرة\n'
          'عدد 6 كراسي\n'
          'نيش\n'
          'بوفيه\n'
          'مرايه بوفيه\n\n'
          'المواصفات:\n\n'
          'الخامات:\n'
          '• ترابيزة السفرة مصنعة من الخشب السونتا بطريقة الـMDF.\n'
          '• كراسي السفرة مصنعة من الخشب الزان الطبيعي.\n'
          '• إكسسوارات مزودة بخاصية التجميع المعدني Mini Fix.\n'
          '• طبقة ميلامين عازلة للرطوبة والحرارة والسوائل ومقاومة للحشرات.\n\n'
          'الأبعاد:\n'
          '• ترابيزة السفرة: طول 180 سم عرض 90 سم إرتفاع 80 سم.\n'
          '• البوفيه: عرض 180 سم إرتفاع بدون المرايا 95 سم عمق مقفول 45 سم عمق مفتوح 95 سم.\n'
          '• النيش: عرض 95 سم إرتفاع 180 سم عمق 45 سم.\n\n'
          'متاح تصميم مقاسات اخري:\n'
          'يمكن إضافة عدد من الكراسي.',
  ),
  Product(
    name: 'ترابيزة سفرة T12 ',
    newPrice: 6.990,
    imageUrl: 'https://www.kabbanifurniture.com/cdn/shop/products/Kabbani-dining-New-t12_1800x1800.jpg?v=1633440497',
    description:   'ترابيزة سفرة\n'
        'عدد 6 كراسي\n'
        'الخامات:\n'
        '• ترابيزة السفرة مصنعة من الخشب السونتا بطريقة الـMDF.\n'
        '• كراسي السفرة مصنعة من الخشب الزان الطبيعي والقماش الشمواة.\n'
        '• إكسسوارات مزودة بخاصية التجميع المعدني Mini Fix.\n'
        '• طبقة ميلامين عازلة للرطوبة والحرارة والسوائل ومقاومة للحشرات.\n'
        '• إسفنج ذو كثافة عالية.\n'
        'الأبعاد:\n'
        '• ترابيزة السفرة: طول 155 سم عرض 98 سم إرتفاع 80 سم.\n'
        'الألوان المتاحة:\n'
        '• الأبيض\n'
        '• الأسود\n'
        '• البني\n\n'
        'متاح تصميم قاسات أخرى',
  ),
  Product(
    name: 'غرفة سفرة لاتيه',
    newPrice:7.200,
    imageUrl: 'https://www.kabbanifurniture.com/cdn/shop/files/6_25155fa2-1d18-4b0f-a95d-043933bde038_1800x1800.jpg?v=1718089764',
    description: 'ترابيزة سفرة\n'
        'عدد 6 كراسي\n'
        'نيش\n'
        'بوفيه\n'
        'مراية بوفيه\n\n'
        'المواصفات:\n\n'
        'الخامات:\n'
        '• ترابيزة السفرة مصنعة من الخشب السونتا بطريقة الـMDF.\n'
        '• كراسي السفرة مصنعة من الخشب الزان الطبيعي.\n'
        '• إكسسوارات مزودة بخاصية التجميع المعدني Mini Fix.\n'
        '• طبقة ميلامين عازلة للرطوبة والحرارة والسوائل ومقاومة للحشرات.\n\n'
        'الأبعاد:\n'
        '• ترابيزة السفرة: طول 180 سم عرض 90 سم إرتفاع 82 سم.\n'
        '• البوفية: عرض 210 سم إرتفاع بدون المرايا 88.5 سم عمق 42 سم.\n'
        '• مراية البوفية: عرض 130 سم إرتفاع 95 سم.\n'
        '• النيش: عرض 93 سم إرتفاع 175 سم عمق 44 سم.\n\n'
        'يمكن إضافة عدد من الكراسي.\n\n'
        'متاح تنفيذ مقاسات اخري \n',
  ),
  Product(
    name: 'غرفة سفرة مرمر',
    newPrice:9.000,
    imageUrl: 'https://www.kabbanifurniture.com/cdn/shop/files/3_d7aa2af0-a255-4dd9-a917-ed68390a24f6_1800x1800.jpg?v=1721906914',
    description:  'ترابيزة سفرة\n'
        'عدد 6 كراسي\n'
        'نيش\n'
        'بوفيه\n\n'
        'المواصفات:\n\n'
        'الخامات:\n'
        '• ترابيزة السفرة مصنعة من الخشب السونتا بطريقة الـMDF.\n'
        '• كراسي السفرة مصنعة من الخشب الزان الطبيعي.\n'
        '• إكسسوارات مزودة بخاصية التجميع المعدني Mini Fix.\n'
        '• طبقة ميلامين عازلة للرطوبة والحرارة والسوائل ومقاومة للحشرات.\n\n'
        'المواصفات الخاصة:\n'
        '• ترابيزة السفرة بها وحدتين تخزين.\n\n'
        'الأبعاد:\n'
        '• ترابيزة السفرة: طول 180 سم.\n'
        '• البوفيه: عرض 200 سم.\n'
        '• نيش: عرض 50 سم.\n\n'
        'متاح تنفيذ مقاسات اخرى:\n'
        '• متاح إضافة كراسي.',
  ),
  Product(
    name: 'غرفة سفرة بلاك',
    newPrice: 9.240,
    imageUrl: 'https://www.kabbanifurniture.com/cdn/shop/products/45_1800x1800.jpg?v=1681814595',
    description:   'ترابيزة سفرة\n'
        'عدد 6 كراسي\n'
        'نيش\n'
        'بوفيه\n'
        'مرايه بوفيه\n\n'
        'المواصفات:\n\n'
        'الخامات:\n'
        '• ترابيزة السفرة مصنعة من الخشب السونتا بطريقة الـMDF.\n'
        '• كراسي السفرة مصنعة من الخشب الزان الطبيعي.\n'
        '• إكسسوارات مزودة بخاصية التجميع المعدني Mini Fix.\n'
        '• طبقة ميلامين عازلة للرطوبة والحرارة والسوائل ومقاومة للحشرات.\n\n'
        'الأبعاد:\n'
        '• ترابيزة السفرة: طول 180 سم.\n'
        '• البوفيه: عرض 200 سم.\n'
        '• النيش: عرض 90 سم.\n\n'
        'ممكن إضافة عدد من الكراسي.\n\n'
        'متاح تنفيذ مقاسات أخرى:\n',
  ),
];
final List<Product> kitchenProducts = [
  Product(
    name: 'مطبخ خشبي مودرن',
    newPrice:33.990 ,
    imageAsset: 'assets/image/1.jpg',
    description:  'ميزي بهذا المطبخ الخشبي بتصميم مودرن يعطي إيحاء بالفخامة\n'
        'والبساطة مع خشب شيبورد معالج مقاوم للماء والعفن والأسطح \n'
        'المكونة من رخام صناعي فاخر مقاوم للتبقع والكسر.\n\n'
        'المواصفات:\n'
        '• عمق الوحدات السفلية: 60 سم\n'
        '• عمق الوحدات العلوية: 30 سم\n'
        '• المسافة بين الوحدات: 60 سم\n'
        '• القياسات: حسب المساحة المطلوبة\n'
        '• خامة الوحدات: خشب شيبورد\n'
        '• خامة الأسطح: رخام صناعي أمريكي أرفاف جرانيت\n'
        '• عدد الوحدات: حسب المساحة وعدد الأمتار والتصميم',
  ),
  Product(
    name: 'مطبخ خشبي مودرن',
    newPrice:33.990 ,
    imageAsset: 'assets/image/4.jpg',
    description:
        'تتميز هذه النوعية من المطابخ بمقاومتها العالية للرطوبة والحرارة والخدوش، كما أنها سهلة التنظيف والصيانة.\n'
        'تتكون هذه المطابخ من لوحات مغلفة بطبقة من البلاستيك المقاوم للحرارة والرطوبة، ويتم تثبيت هذه اللوحات \n'
        'وبفضل هذه التقنية، يمكن الحصول على هذه المطابخ بتصاميم مختلفة وألوان متعددة على هيكل معدني قوي.\n'
        'المواصفات:\n'
        '• عمق الوحدات السفلية: 60 سم\n'
        '• عمق الوحدات العلوية: 30 سم\n'
        '• المسافة بين الوحدات: 60 سم\n'
        '• القياسات: حسب المساحة المطلوبة\n'
        '• خامة الأسطح: رخام صناعي أمريكي أرفاف جرانيت\n'
        '• عدد الوحدات: حسب المساحة وعدد الأمتار والتصميم',
  ),
  Product(
    name: 'مطبخ خشبي مودرن',
    newPrice:33.990 ,
    imageAsset: 'assets/image/5.jpg',
    description:
    'تتميز هذه النوعية من المطابخ بمقاومتها العالية للرطوبة والحرارة والخدوش، كما أنها سهلة التنظيف والصيانة.\n'
        'تتكون هذه المطابخ من لوحات مغلفة بطبقة من البلاستيك المقاوم للحرارة والرطوبة، ويتم تثبيت هذه اللوحات \n'
        'وبفضل هذه التقنية، يمكن الحصول على هذه المطابخ بتصاميم مختلفة وألوان متعددة على هيكل معدني قوي.\n'
        'المواصفات:\n'
        '• عمق الوحدات السفلية: 60 سم\n'
        '• عمق الوحدات العلوية: 30 سم\n'
        '• المسافة بين الوحدات: 60 سم\n'
        '• القياسات: حسب المساحة المطلوبة\n'
        '• خامة الأسطح: رخام صناعي أمريكي أرفاف جرانيت\n'
        '• عدد الوحدات: حسب المساحة وعدد الأمتار والتصميم',
  ),
  Product(
    name: 'مطبخ خشبي مودرن',
    newPrice:33.990 ,
    imageAsset: 'assets/image/2.jpg',
    description:
    'تتميز هذه النوعية من المطابخ بمقاومتها العالية للرطوبة والحرارة والخدوش، كما أنها سهلة التنظيف والصيانة.\n'
        'تتكون هذه المطابخ من لوحات مغلفة بطبقة من البلاستيك المقاوم للحرارة والرطوبة، ويتم تثبيت هذه اللوحات \n'
        'وبفضل هذه التقنية، يمكن الحصول على هذه المطابخ بتصاميم مختلفة وألوان متعددة على هيكل معدني قوي.\n'
        'المواصفات:\n'
        '• عمق الوحدات السفلية: 60 سم\n'
        '• عمق الوحدات العلوية: 30 سم\n'
        '• المسافة بين الوحدات: 60 سم\n'
        '• القياسات: حسب المساحة المطلوبة\n'
        '• خامة الأسطح: رخام صناعي أمريكي أرفاف جرانيت\n'
        '• عدد الوحدات: حسب المساحة وعدد الأمتار والتصميم',
  ),
  Product(
    name: 'مطبخ خشبي مودرن',
    newPrice:30.000 ,
    imageAsset: 'assets/image/6.jpeg',
    description:
    'تتميز هذه النوعية من المطابخ بمقاومتها العالية للرطوبة والحرارة والخدوش، كما أنها سهلة التنظيف والصيانة.\n'
        'تتكون هذه المطابخ من لوحات مغلفة بطبقة من البلاستيك المقاوم للحرارة والرطوبة، ويتم تثبيت هذه اللوحات \n'
        'وبفضل هذه التقنية، يمكن الحصول على هذه المطابخ بتصاميم مختلفة وألوان متعددة على هيكل معدني قوي.\n'
        'المواصفات:\n'
        '• عمق الوحدات السفلية: 60 سم\n'
        '• عمق الوحدات العلوية: 30 سم\n'
        '• المسافة بين الوحدات: 60 سم\n'
        '• القياسات: حسب المساحة المطلوبة\n'
        '• خامة الأسطح: رخام صناعي أمريكي أرفاف جرانيت\n'
        '• عدد الوحدات: حسب المساحة وعدد الأمتار والتصميم',
  ),
  Product(
    name: 'مطبخ صاج مودرن',
    newPrice:33.000 ,
    imageAsset: 'assets/image/3.png',
    description: 'فصلي مطبخ عملي يدعم الاستدامة مع حداثة\n'
        'التصميم المصنوع من الصاج المقاوم للماء والصدأ\n'
        'مع رخام صناعي فاخر لامع مقاوم للبقع والكسر \n'
        ' وإضافة الزجاج كلمسة جمالية وكسر الرتابة.\n\n'
        'المواصفات:\n'
        '• عمق الوحدات السفلية: 60 سم\n'
        '• عمق الوحدات العلوية: 30 سم\n'
        '• المسافة بين الوحدات: 60 سم\n'
        '• القياسات: حسب المساحة المطلوبة\n'
        '• خامة الوحدات: صاج\n'
        '• خامة الأسطح: رخام صناعي أمريكي أرفاف جرانيت\n'
        '• عدد الوحدات: حسب المساحة وعدد الأمتار والتصميم',
  ),
  Product(
    name: 'مطبخ خشبي مودرن',
    newPrice:29.990 ,
    imageAsset: 'assets/image/7.jpeg',
    description:
    'تتميز هذه النوعية من المطابخ بمقاومتها العالية للرطوبة والحرارة والخدوش، كما أنها سهلة التنظيف والصيانة.\n'
        'تتكون هذه المطابخ من لوحات مغلفة بطبقة من البلاستيك المقاوم للحرارة والرطوبة، ويتم تثبيت هذه اللوحات \n'
        'وبفضل هذه التقنية، يمكن الحصول على هذه المطابخ بتصاميم مختلفة وألوان متعددة على هيكل معدني قوي.\n'
        'المواصفات:\n'
        '• عمق الوحدات السفلية: 60 سم\n'
        '• عمق الوحدات العلوية: 30 سم\n'
        '• المسافة بين الوحدات: 60 سم\n'
        '• القياسات: حسب المساحة المطلوبة\n'
        '• خامة الأسطح: رخام صناعي أمريكي أرفاف جرانيت\n'
        '• عدد الوحدات: حسب المساحة وعدد الأمتار والتصميم',
  ),
  Product(
    name: 'مطبخ خشبي مودرن',
    newPrice:30.990 ,
    imageAsset: 'assets/image/8.jpeg',
    description:
    'تتميز هذه النوعية من المطابخ بمقاومتها العالية للرطوبة والحرارة والخدوش، كما أنها سهلة التنظيف والصيانة.\n'
        'تتكون هذه المطابخ من لوحات مغلفة بطبقة من البلاستيك المقاوم للحرارة والرطوبة، ويتم تثبيت هذه اللوحات \n'
        'وبفضل هذه التقنية، يمكن الحصول على هذه المطابخ بتصاميم مختلفة وألوان متعددة على هيكل معدني قوي.\n'
        'المواصفات:\n'
        '• عمق الوحدات السفلية: 60 سم\n'
        '• عمق الوحدات العلوية: 30 سم\n'
        '• المسافة بين الوحدات: 60 سم\n'
        '• القياسات: حسب المساحة المطلوبة\n'
        '• خامة الأسطح: رخام صناعي أمريكي أرفاف جرانيت\n'
        '• عدد الوحدات: حسب المساحة وعدد الأمتار والتصميم',
  ),


];

